---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GenericMEPFailures.SplitElementDeletionWarning
source: html/ea70d10a-5fc5-fcab-5101-e6a02abdc52e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GenericMEPFailures.SplitElementDeletionWarning Property

The value specified for the Joint Gap exceeds the length of the split segment, so the segment will be deleted.

## Syntax (C#)
```csharp
public static FailureDefinitionId SplitElementDeletionWarning { get; }
```